MikroElektronika/core_packages/PIC/XC8/def/PIC16F18176/mcu.h
/****************************************************************************
**
** Copyright (C) 2025 MikroElektronika d.o.o.
** Contact: https://www.mikroe.com/contact
**
** This file is part of the mikroSDK package
**
** Commercial License Usage
**
** Licensees holding valid commercial NECTO compilers AI licenses may use this
** file in accordance with the commercial license agreement provided with the
** Software or, alternatively, in accordance with the terms contained in
** a written agreement between you and The MikroElektronika Company.
** For licensing terms and conditions see
** https://www.mikroe.com/legal/software-license-agreement.
** For further information use the contact form at
** https://www.mikroe.com/contact.
**
**
** GNU Lesser General Public License Usage
**
** Alternatively, this file may be used for
** non-commercial projects under the terms of the GNU Lesser
** General Public License version 3 as published by the Free Software
** Foundation: https://www.gnu.org/licenses/lgpl-3.0.html.
**
** The above copyright notice and this permission notice shall be
** included in all copies or substantial portions of the Software.
**
** THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
** OF MERCHANTABILITY, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED
** TO THE WARRANTIES FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
** IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
** DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT
** OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE
** OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
**
****************************************************************************/

#ifndef __PIC16F18176_H__
#define __PIC16F18176_H__




//*****************************************************************************
//
// 8. Configuration Settings registers
//
//*****************************************************************************

#define CONFIG1                       (*((volatile uint8_t *)0x8007))      // Configuration Word 1
#define CONFIG2                       (*((volatile uint8_t *)0x8008))      // Configuration Word 2
#define CONFIG3                       (*((volatile uint8_t *)0x8009))      // Configuration Word 3


//*****************************************************************************
//
// 10. Power Control registers
//
//*****************************************************************************

#define BORCON                        (*((volatile uint8_t *)0x0191))      // Brown-out Reset Control Register
#define PCON0                         (*((volatile uint8_t *)0x0192))      // Power Control Register 0
#define PCON1                         (*((volatile uint8_t *)0x0193))      // Power Control Register 1


//*****************************************************************************
//
// 11. OSC - Oscillator Module (With Fail-Safe Clock Monitor) registers
//
//*****************************************************************************

#define OSCCON1                       (*((volatile uint8_t *)0x028D))      // Oscillator Control Register 1
#define OSCCON2                       (*((volatile uint8_t *)0x028E))      // Oscillator Control Register 2
#define OSCCON3                       (*((volatile uint8_t *)0x028F))      // Oscillator Control Register 3
#define OSCSTAT                       (*((volatile uint8_t *)0x0290))      // Oscillator Status Register
#define OSCEN                         (*((volatile uint8_t *)0x0291))      // Oscillator Enable Register
#define OSCTUNE                       (*((volatile uint8_t *)0x0292))      // HFINTOSC Frequency Tuning Register
#define OSCFRQ                        (*((volatile uint8_t *)0x0293))      // HFINTOSC Frequency Selection Register
#define ACTCON                        (*((volatile uint8_t *)0x0294))      // Active Clock Tuning Control Register


//*****************************************************************************
//
// 12. INT - Interrupts registers
//
//*****************************************************************************

#define INTCON                        (*((volatile uint8_t *)0x0B))      // Interrupt Control Register
#define PIE0                          (*((volatile uint8_t *)0x0096))      // Peripheral Interrupt Enable Register 0
#define PIE1                          (*((volatile uint8_t *)0x0097))      // Peripheral Interrupt Enable Register 1
#define PIE2                          (*((volatile uint8_t *)0x0098))      // Peripheral Interrupt Enable Register 2
#define PIE3                          (*((volatile uint8_t *)0x0099))      // Peripheral Interrupt Enable Register 3
#define PIE4                          (*((volatile uint8_t *)0x009A))      // Peripheral Interrupt Enable Register 4
#define PIE5                          (*((volatile uint8_t *)0x009B))      // Peripheral Interrupt Enable Register 5
#define PIE6                          (*((volatile uint8_t *)0x009C))      // Peripheral Interrupt Enable Register 6
#define PIR0                          (*((volatile uint8_t *)0x008C))      // Peripheral Interrupt Request Register 0
#define PIR1                          (*((volatile uint8_t *)0x008D))      // Peripheral Interrupt Request Register 1
#define PIR2                          (*((volatile uint8_t *)0x008E))      // Peripheral Interrupt Request Register 2
#define PIR3                          (*((volatile uint8_t *)0x008F))      // Peripheral Interrupt Request Register 3
#define PIR4                          (*((volatile uint8_t *)0x0090))      // Peripheral Interrupt Request Register 4
#define PIR5                          (*((volatile uint8_t *)0x0091))      // Peripheral Interrupt Request Register 5
#define PIR6                          (*((volatile uint8_t *)0x0092))      // Peripheral Interrupt Request Register 6


//*****************************************************************************
//
// 13. Power-Saving Modes registers
//
//*****************************************************************************

#define CPUDOZE                       (*((volatile uint8_t *)0x028C))      // Doze and Idle Register


//*****************************************************************************
//
// 14. WWDT - Windowed Watchdog Timer registers
//
//*****************************************************************************

#define WDTCON0                       (*((volatile uint8_t *)0x018C))      // Watchdog Timer Control Register 0
#define WDTCON1                       (*((volatile uint8_t *)0x018D))      // Watchdog Timer Control Register 1
#define WDTPSL                        (*((volatile uint8_t *)0x018E))      // WWDT Prescaler Select Register (Read-Only)
#define WDTPSH                        (*((volatile uint8_t *)0x018F))      // WWDT Prescaler Select Register (Read-Only)
#define WDTTMR                        (*((volatile uint8_t *)0x0190))      // WDT Timer Register (Read-Only)


//*****************************************************************************
//
// 15. NVM - Nonvolatile Memory Control registers
//
//*****************************************************************************

#define NVMADR                        (*((volatile uint8_t *)0x1C8C))      // Nonvolatile Memory Address Register
#define NVMDAT                        (*((volatile uint8_t *)0x1C8E))      // Nonvolatile Memory Data Register
#define NVMCON1                       (*((volatile uint8_t *)0x1C90))      // Nonvolatile Memory Control 1 Register
#define NVMCON2                       (*((volatile uint8_t *)0x1C91))      // Nonvolatile Memory Control 2 Register


//*****************************************************************************
//
// 16. I/O Ports registers
//
//*****************************************************************************

#define PORTA                         (*((volatile uint8_t *)0x0C))      // PORTx Register
#define PORTB                         (*((volatile uint8_t *)0x0D))      // PORTx Register
#define PORTC                         (*((volatile uint8_t *)0x0E))      // PORTx Register
#define TRISA                         (*((volatile uint8_t *)0x12))      // Tri-State Control Register
#define TRISB                         (*((volatile uint8_t *)0x13))      // Tri-State Control Register
#define TRISC                         (*((volatile uint8_t *)0x14))      // Tri-State Control Register
#define LATA                          (*((volatile uint8_t *)0x18))      // Output Latch Register
#define LATB                          (*((volatile uint8_t *)0x19))      // Output Latch Register
#define LATC                          (*((volatile uint8_t *)0x1A))      // Output Latch Register
#define ANSELA                        (*((volatile uint8_t *)0x1E8B))      // Analog Select Register
#define WPUA                          (*((volatile uint8_t *)0x1E8D))      // Weak Pull-Up Register
#define ODCONA                        (*((volatile uint8_t *)0x1E8E))      // Open-Drain Control Register
#define SLRCONA                       (*((volatile uint8_t *)0x1E8F))      // Slew Rate Control Register
#define INLVLA                        (*((volatile uint8_t *)0x1E90))      // Input Level Control Register
#define ANSELB                        (*((volatile uint8_t *)0x1E96))      // Analog Select Register
#define WPUB                          (*((volatile uint8_t *)0x1E97))      // Weak Pull-Up Register
#define ODCONB                        (*((volatile uint8_t *)0x1E98))      // Open-Drain Control Register
#define SLRCONB                       (*((volatile uint8_t *)0x1E99))      // Slew Rate Control Register
#define INLVLB                        (*((volatile uint8_t *)0x1E9A))      // Input Level Control Register
#define ANSELC                        (*((volatile uint8_t *)0x1EA0))      // Analog Select Register
#define WPUC                          (*((volatile uint8_t *)0x1EA1))      // Weak Pull-Up Register
#define ODCONC                        (*((volatile uint8_t *)0x1EA2))      // Open-Drain Control Register
#define SLRCONC                       (*((volatile uint8_t *)0x1EA3))      // Slew Rate Control Register
#define INLVLC                        (*((volatile uint8_t *)0x1EA4))      // Input Level Control Register
#define RB4I2C                        (*((volatile uint8_t *)0x1EE5))      // I2C Pad Rxy Control Register
#define RB5I2C                        (*((volatile uint8_t *)0x1EE6))      // I2C Pad Rxy Control Register
#define RB6I2C                        (*((volatile uint8_t *)0x1EE7))      // I2C Pad Rxy Control Register
#define RB7I2C                        (*((volatile uint8_t *)0x1EE8))      // I2C Pad Rxy Control Register
#define RC0I2C                        (*((volatile uint8_t *)0x1EE9))      // I2C Pad Rxy Control Register
#define RC1I2C                        (*((volatile uint8_t *)0x1EEA))      // I2C Pad Rxy Control Register
#define RC4I2C                        (*((volatile uint8_t *)0x1EEC))      // I2C Pad Rxy Control Register
#define RC5I2C                        (*((volatile uint8_t *)0x1EED))      // I2C Pad Rxy Control Register


//*****************************************************************************
//
// 17. IOC - Interrupt-on-Change registers
//
//*****************************************************************************

#define IOCAF                         (*((volatile uint8_t *)0x1E93))      // Interrupt-on-Change Flag Register
#define IOCAN                         (*((volatile uint8_t *)0x1E92))      // Interrupt-on-Change Negative Edge Register
#define IOCAP                         (*((volatile uint8_t *)0x1E91))      // Interrupt-on-Change Positive Edge Register
#define IOCBF                         (*((volatile uint8_t *)0x1E9D))      // Interrupt-on-Change Flag Register
#define IOCBN                         (*((volatile uint8_t *)0x1E9C))      // Interrupt-on-Change Negative Edge Register
#define IOCBP                         (*((volatile uint8_t *)0x1E9B))      // Interrupt-on-Change Positive Edge Register
#define IOCCF                         (*((volatile uint8_t *)0x1EA7))      // Interrupt-on-Change Flag Register
#define IOCCN                         (*((volatile uint8_t *)0x1EA6))      // Interrupt-on-Change Negative Edge Register
#define IOCCP                         (*((volatile uint8_t *)0x1EA5))      // Interrupt-on-Change Positive Edge Register


//*****************************************************************************
//
// 18. PPS - Peripheral Pin Select Module registers
//
//*****************************************************************************

