MikroElektronika/core_packages/PIC/XC8/def/PIC16F18176/mcu.h
#define RA0PPS                        (*((volatile uint8_t *)0x1D8C))      // Pin Rxy Output Source Selection Register
#define RA1PPS                        (*((volatile uint8_t *)0x1D8D))      // Pin Rxy Output Source Selection Register
#define RA2PPS                        (*((volatile uint8_t *)0x1D8E))      // Pin Rxy Output Source Selection Register
#define RA4PPS                        (*((volatile uint8_t *)0x1D90))      // Pin Rxy Output Source Selection Register
#define RA5PPS                        (*((volatile uint8_t *)0x1D91))      // Pin Rxy Output Source Selection Register
#define RB4PPS                        (*((volatile uint8_t *)0x1D98))      // Pin Rxy Output Source Selection Register
#define RB5PPS                        (*((volatile uint8_t *)0x1D99))      // Pin Rxy Output Source Selection Register
#define RB6PPS                        (*((volatile uint8_t *)0x1D9A))      // Pin Rxy Output Source Selection Register
#define RB7PPS                        (*((volatile uint8_t *)0x1D9B))      // Pin Rxy Output Source Selection Register
#define RC0PPS                        (*((volatile uint8_t *)0x1D9C))      // Pin Rxy Output Source Selection Register
#define RC1PPS                        (*((volatile uint8_t *)0x1D9D))      // Pin Rxy Output Source Selection Register
#define RC2PPS                        (*((volatile uint8_t *)0x1D9E))      // Pin Rxy Output Source Selection Register
#define RC3PPS                        (*((volatile uint8_t *)0x1D9F))      // Pin Rxy Output Source Selection Register
#define RC4PPS                        (*((volatile uint8_t *)0x1DA0))      // Pin Rxy Output Source Selection Register
#define RC5PPS                        (*((volatile uint8_t *)0x1DA1))      // Pin Rxy Output Source Selection Register
#define RC6PPS                        (*((volatile uint8_t *)0x1DA2))      // Pin Rxy Output Source Selection Register
#define RC7PPS                        (*((volatile uint8_t *)0x1DA3))      // Pin Rxy Output Source Selection Register
#define PPSLOCK                       (*((volatile uint8_t *)0x1E0C))      // PPS Lock Register
#define INTPPS                        (*((volatile uint8_t *)0x1E0D))      // Peripheral Input Selection Register
#define T0CKIPPS                      (*((volatile uint8_t *)0x1E0E))      // Peripheral Input Selection Register
#define T1CKIPPS                      (*((volatile uint8_t *)0x1E0F))      // Peripheral Input Selection Register
#define T1GPPS                        (*((volatile uint8_t *)0x1E10))      // Peripheral Input Selection Register
#define T3CKIPPS                      (*((volatile uint8_t *)0x1E11))      // Peripheral Input Selection Register
#define T3GPPS                        (*((volatile uint8_t *)0x1E12))      // Peripheral Input Selection Register
#define T2INPPS                       (*((volatile uint8_t *)0x1E19))      // Peripheral Input Selection Register
#define T4INPPS                       (*((volatile uint8_t *)0x1E1A))      // Peripheral Input Selection Register
#define CCP1PPS                       (*((volatile uint8_t *)0x1E1E))      // Peripheral Input Selection Register
#define CCP2PPS                       (*((volatile uint8_t *)0x1E1F))      // Peripheral Input Selection Register
#define PWMIN0PPS                     (*((volatile uint8_t *)0x1E24))      // Peripheral Input Selection Register
#define PWMIN1PPS                     (*((volatile uint8_t *)0x1E25))      // Peripheral Input Selection Register
#define PWM1ERSPPS                    (*((volatile uint8_t *)0x1E26))      // Peripheral Input Selection Register
#define PWM2ERSPPS                    (*((volatile uint8_t *)0x1E27))      // Peripheral Input Selection Register
#define CWG1PPS                       (*((volatile uint8_t *)0x1E39))      // Peripheral Input Selection Register
#define CLCIN0PPS                     (*((volatile uint8_t *)0x1E3D))      // Peripheral Input Selection Register
#define CLCIN1PPS                     (*((volatile uint8_t *)0x1E3E))      // Peripheral Input Selection Register


//*****************************************************************************
//
// 19. CRC - Cyclic Redundancy Check Module with Memory Scanner registers
//
//*****************************************************************************

#define SCANHADR                      (*((volatile uint8_t *)0x1C92))      // Scan High Address Registers
#define SCANLADR                      (*((volatile uint8_t *)0x1C95))      // Scan Low Address Registers
#define SCANCON0                      (*((volatile uint8_t *)0x1C98))      // Scanner Access Control Register 0
#define SCANTRIG                      (*((volatile uint8_t *)0x1C99))      // SCAN Trigger Selection Register
#define CRCDATA                       (*((volatile uint8_t *)0x1C9A))      // CRC Data Registers
#define CRCOUT                        (*((volatile uint8_t *)0x1C9E))      // CRC Output Registers
#define CRCSHIFT                      (*((volatile uint8_t *)0x1C9E))      // CRC Shift Registers
#define CRCXOR                        (*((volatile uint8_t *)0x1C9E))      // CRC XOR Registers
#define CRCCON0                       (*((volatile uint8_t *)0x1CA2))      // CRC Control Register 0
#define CRCCON1                       (*((volatile uint8_t *)0x1CA3))      // CRC Control Register 1
#define CRCCON2                       (*((volatile uint8_t *)0x1CA4))      // CRC Control Register 2


//*****************************************************************************
//
// 20. PMD - Peripheral Module Disable registers
//
//*****************************************************************************

#define PMD0                          (*((volatile uint8_t *)0x010C))      // PMD Control Register 0
#define PMD1                          (*((volatile uint8_t *)0x010D))      // PMD Control Register 1
#define PMD2                          (*((volatile uint8_t *)0x010E))      // PMD Control Register 2
#define PMD3                          (*((volatile uint8_t *)0x010F))      // PMD Control Register 3
#define PMD4                          (*((volatile uint8_t *)0x0110))      // PMD Control Register 4


//*****************************************************************************
//
// 21. CLKREF - Reference Clock Output Module registers
//
//*****************************************************************************

