MikroElektronika/core_packages/PIC/XC8/def/PIC16F18176/mcu.h
#define CLKRCON                       (*((volatile uint8_t *)0x0296))      // Reference Clock Control Register
#define CLKRCLK                       (*((volatile uint8_t *)0x0297))      // Clock Reference Clock Selection Register


//*****************************************************************************
//
// 22. TMR0 - Timer0 Module registers
//
//*****************************************************************************

#define TMR0L                         (*((volatile uint8_t *)0x019C))      // Timer0 Period/Count Low Register
#define TMR0H                         (*((volatile uint8_t *)0x019D))      // Timer0 Period/Count High Register
#define T0CON0                        (*((volatile uint8_t *)0x019E))      // Timer0 Control Register 0
#define T0CON1                        (*((volatile uint8_t *)0x019F))      // Timer0 Control Register 1


//*****************************************************************************
//
// 23. TMR1 - Timer1 Module with Gate Control registers
//
//*****************************************************************************

#define TMR1                          (*((volatile uint8_t *)0x030C))      // Timer Register
#define T1CON                         (*((volatile uint8_t *)0x030E))      // Timer Control Register
#define T1GCON                        (*((volatile uint8_t *)0x030F))      // Timer Gate Control Register
#define T1GATE                        (*((volatile uint8_t *)0x0310))      // Timer Gate Source Selection Register
#define T1CLK                         (*((volatile uint8_t *)0x0311))      // Timer Clock Source Selection Register


//*****************************************************************************
//
// 24. TMR2 - Timer2 Module registers
//
//*****************************************************************************

#define T2TMR                         (*((volatile uint8_t *)0x038C))      // Timer Counter Register
#define T2PR                          (*((volatile uint8_t *)0x038D))      // Timer Period Register
#define T2CON                         (*((volatile uint8_t *)0x038E))      // Timerx Control Register
#define T2HLT                         (*((volatile uint8_t *)0x038F))      // Timer Hardware Limit Control Register
#define T2CLKCON                      (*((volatile uint8_t *)0x0390))      // Timer Clock Source Selection Register
#define T2RST                         (*((volatile uint8_t *)0x0391))      // Timer External Reset Signal Selection Register
#define T4TMR                         (*((volatile uint8_t *)0x0392))      // Timer Counter Register
#define T4PR                          (*((volatile uint8_t *)0x0393))      // Timer Period Register
#define T4CON                         (*((volatile uint8_t *)0x0394))      // Timerx Control Register
#define T4HLT                         (*((volatile uint8_t *)0x0395))      // Timer Hardware Limit Control Register
#define T4CLKCON                      (*((volatile uint8_t *)0x0396))      // Timer Clock Source Selection Register
#define T4RST                         (*((volatile uint8_t *)0x0397))      // Timer External Reset Signal Selection Register


//*****************************************************************************
//
// 25. NCO - Numerically Controlled Oscillator Module registers
//
//*****************************************************************************

#define NCO1ACC                       (*((volatile uint8_t *)0x058C))      // NCO Accumulator Register
#define NCO1INC                       (*((volatile uint8_t *)0x058F))      // NCO Increment Register
#define NCO1CON                       (*((volatile uint8_t *)0x0592))      // NCO Control Register
#define NCO1CLK                       (*((volatile uint8_t *)0x0593))      // NCO Input Clock Control Register


//*****************************************************************************
//
// 26. CWG - Complementary Waveform Generator Module registers
//
//*****************************************************************************

#define CWG1CLK                       (*((volatile uint8_t *)0x060C))      // CWG Clock Input Selection Register
#define CWG1ISM                       (*((volatile uint8_t *)0x060D))      // CWGx Input Selection Register
#define CWG1DBR                       (*((volatile uint8_t *)0x060E))      // CWG Rising Dead-Band Count Register
#define CWG1DBF                       (*((volatile uint8_t *)0x060F))      // CWG Falling Dead-Band Count Register
#define CWG1CON0                      (*((volatile uint8_t *)0x0610))      // CWG Control Register 0
#define CWG1CON1                      (*((volatile uint8_t *)0x0611))      // CWG Control Register 1
#define CWG1AS0                       (*((volatile uint8_t *)0x0612))      // CWG Auto-Shutdown Control Register 0
#define CWG1AS1                       (*((volatile uint8_t *)0x0613))      // CWG Auto-Shutdown Control Register 1
#define CWG1STR                       (*((volatile uint8_t *)0x0614))      // CWG Steering Control Register


//*****************************************************************************
//
// 27. CCP - Capture/Compare/PWM Module registers
//
//*****************************************************************************

#define CCPR1                         (*((volatile uint8_t *)0x040C))      // Capture/Compare/Pulse-Width Register
#define CCP1CON                       (*((volatile uint8_t *)0x040E))      // CCP Control Register
#define CCP1CAP                       (*((volatile uint8_t *)0x040F))      // Capture Trigger Input Selection Register
#define CCPR2                         (*((volatile uint8_t *)0x0410))      // Capture/Compare/Pulse-Width Register
#define CCP2CON                       (*((volatile uint8_t *)0x0412))      // CCP Control Register
#define CCP2CAP                       (*((volatile uint8_t *)0x0413))      // Capture Trigger Input Selection Register


//*****************************************************************************
//
// 28. Capture, Compare, and PWM Timers Selection registers
//
//*****************************************************************************

#define CCPTMRS0                      (*((volatile uint8_t *)0x041F))      // CCP Timers Selection Register


//*****************************************************************************
//
// 29. PWM - Pulse-Width Modulator with Compare registers
//
//*****************************************************************************

#define PWM1ERS                       (*((volatile uint8_t *)0x048C))      // PWM1 External Reset Source
#define PWM1CLK                       (*((volatile uint8_t *)0x048D))      // PWM1 Clock Source
#define PWM1LDS                       (*((volatile uint8_t *)0x048E))      // PWM1 Auto-load Trigger Source Select Register
#define PWM1PR                        (*((volatile uint8_t *)0x048F))      // PWM1 Period Register
#define PWM1CPRE                      (*((volatile uint8_t *)0x0491))      // PWM1 Clock Prescaler Register
#define PWM1PIPOS                     (*((volatile uint8_t *)0x0492))      // PWM1 Period Interrupt Postscaler Register
#define PWM1GIR                       (*((volatile uint8_t *)0x0493))      // PWM1 Interrupt Register
#define PWM1GIE                       (*((volatile uint8_t *)0x0494))      // PWM1 Interrupt Enable Register
#define PWM1CON                       (*((volatile uint8_t *)0x0495))      // PWM Control Register
#define PWM1S1CFG                     (*((volatile uint8_t *)0x0496))      // PWM Slice “a” Configuration Register
#define PWM1S1P1                      (*((volatile uint8_t *)0x0497))      // PWM Slice “a” Parameter 1 Register
#define PWM1S1P2                      (*((volatile uint8_t *)0x0499))      // PWM Slice “a” Parameter 2 Register
#define PWMLOAD                       (*((volatile uint8_t *)0x049E))      // Mirror copies of all PWMxLD bits
#define PWMEN                         (*((volatile uint8_t *)0x049F))      // Mirror copies of all PWMxEN bits
#define PWM2ERS                       (*((volatile uint8_t *)0x050C))      // PWM2 External Reset Source
#define PWM2CLK                       (*((volatile uint8_t *)0x050D))      // PWM2 Clock Source
#define PWM2LDS                       (*((volatile uint8_t *)0x050E))      // PWM2 Auto-load Trigger Source Select Register
#define PWM2PR                        (*((volatile uint8_t *)0x050F))      // PWM2 Period Register
#define PWM2CPRE                      (*((volatile uint8_t *)0x0511))      // PWM2 Clock Prescaler Register
#define PWM2PIPOS                     (*((volatile uint8_t *)0x0512))      // PWM2 Period Interrupt Postscaler Register
#define PWM2GIR                       (*((volatile uint8_t *)0x0513))      // PWM2 Interrupt Register
#define PWM2GIE                       (*((volatile uint8_t *)0x0514))      // PWM2 Interrupt Enable Register
#define PWM2CON                       (*((volatile uint8_t *)0x0515))      // PWM Control Register
#define PWM2S1CFG                     (*((volatile uint8_t *)0x0516))      // PWM Slice “a” Configuration Register
#define PWM2S1P1                      (*((volatile uint8_t *)0x0517))      // PWM Slice “a” Parameter 1 Register
#define PWM2S1P2                      (*((volatile uint8_t *)0x0519))      // PWM Slice “a” Parameter 2 Register


//*****************************************************************************
//
// 30. CLC - Configurable Logic Cell registers
//
//*****************************************************************************

#define CLCSELECT                     (*((volatile uint8_t *)0x0696))      // CLC Instance Selection Register
#define CLCDATA                       (*((volatile uint8_t *)0x0697))      // CLC Data Output Register


//*****************************************************************************
//
// 32. EUSART - Enhanced Universal Synchronous Asynchronous Receiver Transmitter registers
//
//*****************************************************************************

#define RCREG                         (*((volatile uint8_t *)0x070C))      // Receive data
#define TXREG                         (*((volatile uint8_t *)0x070D))      // Transmit Data
#define SPBRG                         (*((volatile uint8_t *)0x070E))      // Baud Rate Register
#define RCSTA                         (*((volatile uint8_t *)0x0710))      // Receive Status and Control Register
#define TXSTA                         (*((volatile uint8_t *)0x0711))      // Transmit Status and Control Register
#define BAUDCON                       (*((volatile uint8_t *)0x0712))      // Baud Rate Control Register
#define RCREG                         (*((volatile uint8_t *)0x0716))      // Receive data
#define TXREG                         (*((volatile uint8_t *)0x0717))      // Transmit Data
#define SPBRG                         (*((volatile uint8_t *)0x0718))      // Baud Rate Register
#define RCSTA                         (*((volatile uint8_t *)0x071A))      // Receive Status and Control Register
#define TXSTA                         (*((volatile uint8_t *)0x071B))      // Transmit Status and Control Register
#define BAUDCON                       (*((volatile uint8_t *)0x071C))      // Baud Rate Control Register


//*****************************************************************************
//
// 33. ADC - Analog-to-Digital Converter with Computation Module registers
//
//*****************************************************************************

#define ADSTAT                        (*((volatile uint8_t *)0x1D2A))      // ADC Status Register
#define ADCLK                         (*((volatile uint8_t *)0x1D2D))      // ADC Clock divider Register
#define ADREF                         (*((volatile uint8_t *)0x1D2B))      // ADC Reference Selection Register
#define ADPCH                         (*((volatile uint8_t *)0x1D1F))      // ADC Positive Channel Selection Register
#define ADNCH                         (*((volatile uint8_t *)0x1D20))      // ADC Negative Channel Selection Register
#define ADACQ                         (*((volatile uint8_t *)0x1D21))      // ADC Acquisition Time Control Register
#define ADCAP                         (*((volatile uint8_t *)0x1D23))      // ADC Additional Sample Capacitor Selection Register
#define ADPRE                         (*((volatile uint8_t *)0x1D24))      // ADC Precharge Time Control Register
#define ADCON0                        (*((volatile uint8_t *)0x1D26))      // ADC Control Register 0
#define ADCON1                        (*((volatile uint8_t *)0x1D27))      // ADC Control Register 1
#define ADCON2                        (*((volatile uint8_t *)0x1D28))      // ADC Control Register 2
#define ADCON3                        (*((volatile uint8_t *)0x1D29))      // ADC Control Register 3
#define ADACT                         (*((volatile uint8_t *)0x1D2C))      // ADC Auto-Conversion Trigger Source Selection Register
#define ADLTH                         (*((volatile uint8_t *)0x1D0C))      // ADC Lower Threshold Register
#define ADUTH                         (*((volatile uint8_t *)0x1D0E))      // ADC Upper Threshold Register
#define ADERR                         (*((volatile uint8_t *)0x1D10))      // ADC Setpoint Error Register
#define ADSTPT                        (*((volatile uint8_t *)0x1D12))      // ADC Threshold Setpoint Register
#define ADFLTR                        (*((volatile uint8_t *)0x1D14))      // ADC Filter Register
#define ADACC                         (*((volatile uint8_t *)0x1D16))      // ADC Accumulator Register
#define ADCNT                         (*((volatile uint8_t *)0x1D19))      // ADC Repeat Counter Register
#define ADRPT                         (*((volatile uint8_t *)0x1D1A))      // ADC Repeat Setting Register
#define ADPREV                        (*((volatile uint8_t *)0x1D1B))      // ADC Previous Result Register
#define ADRES                         (*((volatile uint8_t *)0x1D1D))      // ADC Result Register


//*****************************************************************************
//
// 34. DAC - Digital-to-Analog Converter Module registers
//
//*****************************************************************************

#define DAC1CON                       (*((volatile uint8_t *)0x088C))      // Digital-to-Analog Converter Control Register
#define DAC1DATL                      (*((volatile uint8_t *)0x088D))      // Digital-to-Analog Converter Data Register
#define DAC2CON                       (*((volatile uint8_t *)0x0890))      // Digital-to-Analog Converter Control Register
#define DAC2DATL                      (*((volatile uint8_t *)0x0891))      // Digital-to-Analog Converter Data Register


//*****************************************************************************
//
// 35. CMP - Comparator Module registers
//
//*****************************************************************************

#define CM1CON0                       (*((volatile uint8_t *)0x080C))      // Comparator Control Register 0
#define CM1CON1                       (*((volatile uint8_t *)0x080D))      // Comparator Control Register 1
#define CM1NCH                        (*((volatile uint8_t *)0x080E))      // Comparator Inverting Channel Select Register
#define CM1PCH                        (*((volatile uint8_t *)0x080F))      // Comparator Noninverting Channel Select Register
#define CM2CON0                       (*((volatile uint8_t *)0x0810))      // Comparator Control Register 0
#define CM2CON1                       (*((volatile uint8_t *)0x0811))      // Comparator Control Register 1
#define CM2NCH                        (*((volatile uint8_t *)0x0812))      // Comparator Inverting Channel Select Register
#define CM2PCH                        (*((volatile uint8_t *)0x0813))      // Comparator Noninverting Channel Select Register
#define CMOUT                         (*((volatile uint8_t *)0x081F))      // Comparator Output Register


//*****************************************************************************
//
// 36. FVR - Fixed Voltage Reference registers
//
//*****************************************************************************

#define FVRCON                        (*((volatile uint8_t *)0x020C))      // FVR Control Register


//*****************************************************************************
//
// 37. Temperature Indicator Module registers
//
//*****************************************************************************

#define FVRCON                        (*((volatile uint8_t *)0x020C))      // FVR Control Register


//*****************************************************************************
//
// 38. ZCD - Zero-Cross Detection Module registers
//
//*****************************************************************************

#define ZCDCON                        (*((volatile uint8_t *)0x021F))      // Zero-Cross Detect Control Register


//*****************************************************************************
//
// 39. Charge Pump registers
//
//*****************************************************************************

