MikroElektronika/core_packages/PIC/XC8/def/PIC16F18176/mcu.h
#define CPCON                         (*((volatile uint8_t *)0x020D))      // Charge Pump Control Register



//*****************************************************************************
//
// The following are defines for the bit fields in the CONFIG1 register.
//
//*****************************************************************************

#define SBOREN                        0x00000080      // Software Brown-Out Reset Enable
#define BORRDY                        0x00000001      // Brown-Out Reset Circuit Ready Status


//*****************************************************************************
//
// The following are defines for the bit fields in the CONFIG2 register.
//
//*****************************************************************************

#define STKOVF                        0x00000080      // Stack Overflow Flag
#define STKUNF                        0x00000040      // Stack Underflow Flag
#define WDTWV                         0x00000020      // WDT Window Violation
#define RWDT                          0x00000010      // WDT Reset Flag
#define RMCLR                         0x00000008      // MCLR Reset Flag
#define RI                            0x00000004      // RESET Instruction Flag
#define POR                           0x00000002      // Power-on Reset Status
#define BOR                           0x00000001      // Brown-out Reset Status


//*****************************************************************************
//
// The following are defines for the bit fields in the CONFIG3 register.
//
//*****************************************************************************

#define MEMV                          0x00000002      // Memory Violation Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the BORCON register.
//
//*****************************************************************************

#define SBOREN                        0x00000080      // Software Brown-Out Reset Enable
#define BORRDY                        0x00000001      // Brown-Out Reset Circuit Ready Status


//*****************************************************************************
//
// The following are defines for the bit fields in the PCON0 register.
//
//*****************************************************************************

#define STKOVF                        0x00000080      // Stack Overflow Flag
#define STKUNF                        0x00000040      // Stack Underflow Flag
#define WDTWV                         0x00000020      // WDT Window Violation
#define RWDT                          0x00000010      // WDT Reset Flag
#define RMCLR                         0x00000008      // MCLR Reset Flag
#define RI                            0x00000004      // RESET Instruction Flag
#define POR                           0x00000002      // Power-on Reset Status
#define BOR                           0x00000001      // Brown-out Reset Status


//*****************************************************************************
//
// The following are defines for the bit fields in the PCON1 register.
//
//*****************************************************************************

#define MEMV                          0x00000002      // Memory Violation Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the ACTCON register.
//
//*****************************************************************************

#define ACTEN                         0x00000080      // Active Clock Tuning Enable
#define ACTUD                         0x00000040      // Active Clock Tuning Update Disable
#define ACTLOCK                       0x00000008      // Active Clock Tuning Lock Status
#define ACTORS                        0x00000002      // Active Clock Tuning Out-of-Range Status


//*****************************************************************************
//
// The following are defines for the bit fields in the OSCCON1 register.
//
//*****************************************************************************

#define NOSC[2:0]                     0x000001C0      // New Oscillator Source Request
#define NDIV[3:0]                     0x00000078      // New Divider Selection Request


//*****************************************************************************
//
// The following are defines for the bit fields in the OSCCON2 register.
//
//*****************************************************************************

#define COSC[2:0]                     0x000001C0      // Current Oscillator Source Select
#define CDIV[3:0]                     0x00000078      // Current Divider Select


//*****************************************************************************
//
// The following are defines for the bit fields in the OSCCON3 register.
//
//*****************************************************************************

#define CSWHOLD                       0x00000080      // Clock Switch Hold Control
#define SOSCPWR                       0x00000040      // Secondary Oscillator Power Mode Select
#define ORDY                          0x00000010      // Oscillator Ready
#define NOSCR                         0x00000008      // New Oscillator is Ready


//*****************************************************************************
//
// The following are defines for the bit fields in the OSCTUNE register.
//
//*****************************************************************************

#define TUN[5:0]                      0x000007E0      // HFINTOSC Frequency Tuning


//*****************************************************************************
//
// The following are defines for the bit fields in the OSCFRQ register.
//
//*****************************************************************************

#define FRQ[2:0]                      0x0000001C      // HFINTOSC  Frequency Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the OSCSTAT register.
//
//*****************************************************************************

