MikroElektronika/core_packages/PIC/XC8/def/PIC16F18176/mcu.h
#define EXTOR                         0x00000080      // External Oscillator Ready
#define HFOR                          0x00000040      // HFINTOSC Ready
#define MFOR                          0x00000020      // MFINTOSC Ready
#define LFOR                          0x00000010      // LFINTOSC Ready
#define SOR                           0x00000008      // Secondary Oscillator (SOSC) Ready
#define ADOR                          0x00000004      // ADCRC Oscillator Ready
#define SFOR                          0x00000002      // SFINTOSC Oscillator Ready
#define PLLR                          0x00000001      // PLL is Ready


//*****************************************************************************
//
// The following are defines for the bit fields in the OSCEN register.
//
//*****************************************************************************

#define EXTOEN                        0x00000080      // External Oscillator Enable
#define HFOEN                         0x00000040      // HFINTOSC Enable
#define MFOEN                         0x00000020      // MFINTOSC Enable
#define LFOEN                         0x00000010      // LFINTOSC Enable
#define SOSCEN                        0x00000008      // Secondary Oscillator Enable
#define ADOEN                         0x00000004      // ADCRC Oscillator Enable
#define PLLEN                         0x00000001      // PLL Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the INTCON register.
//
//*****************************************************************************

#define GIE                           0x00000080      // Global Interrupt Enable
#define PEIE                          0x00000040      // Peripheral Interrupt Enable
#define INTEDG                        0x00000001      // External Interrupt Edge Select


//*****************************************************************************
//
// The following are defines for the bit fields in the PIE0 register.
//
//*****************************************************************************

#define TMR0IE                        0x00000020      // Timer0 Interrupt Enable
#define IOCIE                         0x00000010      // Interrupt-on-Change Enable
#define INTE                          0x00000001      // External Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the PIE1 register.
//
//*****************************************************************************

#define TMR1GIE                       0x00000080      // TMR1 Gate Interrupt Enable
#define TMR1IE                        0x00000040      // TMR1 Interrupt Enable
#define OSFIE                         0x00000020      // Oscillator Failure Interrupt Enable
#define CSWIE                         0x00000010      // Clock Switch Interrupt Enable
#define ACTIE                         0x00000008      // Active Clock Tuning Interrupt Enable
#define SCANIE                        0x00000004      // Memory Scanner Interrupt Enable
#define CRCIE                         0x00000002      // CRC Interrupt Enable
#define NVMIE                         0x00000001      // NVM Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the PIE2 register.
//
//*****************************************************************************

#define CCP2IE                        0x00000040      // CCP2 Interrupt Enable
#define CCP1IE                        0x00000020      // CCP1 Interrupt Enable
#define TMR4IE                        0x00000008      // TMR4 Interrupt Enable
#define TMR2IE                        0x00000004      // TMR2 Interrupt Enable
#define TMR3GIE                       0x00000002      // TMR3 Gate Interrupt Enable
#define TMR3IE                        0x00000001      // TMR3 Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the PIE3 register.
//
//*****************************************************************************

#define PWM2IE                        0x00000008      // PWM2 Parameter Interrupt Enable
#define PWM2PIE                       0x00000004      // PWM2 Period Interrupt Enable
#define PWM1IE                        0x00000002      // PWM1 Parameter Interrupt Enable
#define PWM1PIE                       0x00000001      // PWM1 Period Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the PIE4 register.
//
//*****************************************************************************

#define RC1IE                         0x00000080      // EUSART1 Receive Interrupt Enable
#define TX1IE                         0x00000040      // EUSART1 Transmit Interrupt Enable
#define CLC4IE                        0x00000020      // CLC4 Interrupt Enable
#define CLC3IE                        0x00000010      // CLC3 Interrupt Enable
#define CLC2IE                        0x00000008      // CLC2 Interrupt Enable
#define CLC1IE                        0x00000004      // CLC1 Interrupt Enable
#define CWG1IE                        0x00000002      // CWG1 Interrupt Enable
#define NCO1IE                        0x00000001      // NCO1 Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the PIE5 register.
//
//*****************************************************************************

#define CM2IE                         0x00000080      // Comparator 2 Interrupt Enable
#define CM1IE                         0x00000040      // Comparator 1 Interrupt Enable
#define BCL2IE                        0x00000020      // MSSP2 Bus Collision Interrupt Enable
#define SSP2IE                        0x00000010      // MSSP2 Interrupt Enable
#define BCL1IE                        0x00000008      // MSSP1 Bus Collision Interrupt Enable
#define SSP1IE                        0x00000004      // MSSP1 Interrupt Enable
#define RC2IE                         0x00000002      // EUSART2 Receive Interrupt Enable
#define TX2IE                         0x00000001      // EUSART2 Transmit Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the PIE6 register.
//
//*****************************************************************************

