MikroElektronika/core_packages/PIC/XC8/def/PIC16F18176/mcu.h
#define ZCDIE                         0x00000004      // ZCD Interrupt Enable
#define ADTIE                         0x00000002      // ADC Threshold Interrupt Enable
#define ADIE                          0x00000001      // ADC Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the PIR0 register.
//
//*****************************************************************************

#define TMR0IF                        0x00000020      // Timer0 Interrupt Flag
#define IOCIF                         0x00000010      // Interrupt-on-Change Flag
#define INTF                          0x00000001      // External Interrupt Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the PIR1 register.
//
//*****************************************************************************

#define TMR1GIF                       0x00000080      // TMR1 Gate Interrupt Flag
#define TMR1IF                        0x00000040      // TMR1 Interrupt Flag
#define OSFIF                         0x00000020      // Oscillator Failure Interrupt Flag
#define CSWIF                         0x00000010      // Clock Switch Interrupt Flag
#define ACTIF                         0x00000008      // Active Clock Tuning Interrupt Flag
#define SCANIF                        0x00000004      // Memory Scanner Interrupt Flag
#define CRCIF                         0x00000002      // CRC Interrupt Flag
#define NVMIF                         0x00000001      // Nonvolatile Memory (NVM) Interrupt Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the PIR2 register.
//
//*****************************************************************************

#define CCP2IF                        0x00000040      // CCP2 Interrupt Flag
#define CCP1IF                        0x00000020      // CCP1 Interrupt Flag
#define TMR4IF                        0x00000008      // TMR4 Interrupt Flag
#define TMR2IF                        0x00000004      // TMR2 Interrupt Flag
#define TMR3GIF                       0x00000002      // TMR3 Gate Interrupt Flag
#define TMR3IF                        0x00000001      // TMR3 Interrupt Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the PIR3 register.
//
//*****************************************************************************

#define PWM2IF                        0x00000008      // PWM2 Parameter Interrupt Flag
#define PWM2PIF                       0x00000004      // PWM2 Period Interrupt Flag
#define PWM1IF                        0x00000002      // PWM1 Parameter Interrupt Flag
#define PWM1PIF                       0x00000001      // PWM1 Period Interrupt Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the PIR4 register.
//
//*****************************************************************************

#define RC1IF                         0x00000080      // EUSART1 Receive Interrupt Flag
#define TX1IF                         0x00000040      // EUSART1 Transmit Interrupt Flag
#define CLC4IF                        0x00000020      // CLC4 Interrupt Flag
#define CLC3IF                        0x00000010      // CLC3 Interrupt Flag
#define CLC2IF                        0x00000008      // CLC2 Interrupt Flag
#define CLC1IF                        0x00000004      // CLC1 Interrupt Flag
#define CWG1IF                        0x00000002      // CWG1 Interrupt Flag
#define NCO1IF                        0x00000001      // NCO1 Interrupt Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the PIR5 register.
//
//*****************************************************************************

#define CM2IF                         0x00000080      // Comparator 2 Interrupt Flag
#define CM1IF                         0x00000040      // Comparator 1 Interrupt Flag
#define BCL2IF                        0x00000020      // MSSP2 Bus Collision Interrupt Flag
#define SSP2IF                        0x00000010      // MSSP2 Interrupt Flag
#define BCL1IF                        0x00000008      // MSSP1 Bus Collision Interrupt Flag
#define SSP1IF                        0x00000004      // MSSP1 Interrupt Flag
#define RC2IF                         0x00000002      // EUSART2 Receive Interrupt Flag
#define TX2IF                         0x00000001      // EUSART2 Transmit Interrupt Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the PIR6 register.
//
//*****************************************************************************

#define ZCDIF                         0x00000004      // Zero-Cross Detect (ZCD) Interrupt Flag
#define ADTIF                         0x00000002      // ADC Threshold Interrupt Flag
#define ADIF                          0x00000001      // ADC Interrupt Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the CPUDOZE register.
//
//*****************************************************************************

#define IDLEN                         0x00000080      // Idle Enable
#define DOZEN                         0x00000040      // Doze Enable
#define ROI                           0x00000020      // Recover-on-Interrupt
#define DOE                           0x00000010      // Doze-on-Exit
#define DOZE[2:0]                     0x00000004      // Ratio of CPU Instruction Cycles to Peripheral Instruction Cycles


//*****************************************************************************
//
// The following are defines for the bit fields in the WDTCON0 register.
//
//*****************************************************************************

#define PS[4:0]                       0x00000020      // Watchdog Timer Prescaler Select
#define SEN                           0x00000001      // Software Enable/Disable for Watchdog Timer


//*****************************************************************************
//
// The following are defines for the bit fields in the WDTCON1 register.
//
//*****************************************************************************

#define CS[2:0]                       0x00000040      // Watchdog Timer Clock Select
#define WINDOW[2:0]                   0x00000004      // Watchdog Timer Window Select


//*****************************************************************************
//
// The following are defines for the bit fields in the WDTPSH register.
//
//*****************************************************************************

