MikroElektronika/core_packages/PIC/XC8/def/PIC16F18176/mcu.h
#define PSCNTH[7:0]                   0x00000080      // Prescaler Select High Byte


//*****************************************************************************
//
// The following are defines for the bit fields in the WDTPSL register.
//
//*****************************************************************************

#define PSCNTL[7:0]                   0x00000080      // Prescaler Select Low Byte


//*****************************************************************************
//
// The following are defines for the bit fields in the WDTTMR register.
//
//*****************************************************************************

#define TMR[4:0]                      0x00000080      // Watchdog Window Value
#define STATE                         0x00000004      // WDT Armed Status
#define PSCNT[17:16]                  0x00000002      // Prescaler Select Upper Byte


//*****************************************************************************
//
// The following are defines for the bit fields in the NVMADR register.
//
//*****************************************************************************

#define NVMADR[14:0]                  0x00004000      // NVM Address Bits


//*****************************************************************************
//
// The following are defines for the bit fields in the NVMDAT register.
//
//*****************************************************************************

#define NVMDAT[13:0]                  0x00002000      // NVM Data bits


//*****************************************************************************
//
// The following are defines for the bit fields in the NVMCON1 register.
//
//*****************************************************************************

#define NVMREGS                       0x00000040      // NVM Region Selection
#define LWLO                          0x00000020      // Load Write Latches Only
#define FREE                          0x00000010      // Program Flash Memory Erase Enable
#define WRERR                         0x00000008      // Write-Reset Error Flag
#define WREN                          0x00000004      // Program/Erase Enable
#define WR                            0x00000002      // Write Control
#define RD                            0x00000001      // Read Control


//*****************************************************************************
//
// The following are defines for the bit fields in the NVMCON2 register.
//
//*****************************************************************************

#define NVMCON2[7:0]                  0x00000080      // Flash Memory Unlock Pattern bits


//*****************************************************************************
//
// The following are defines for the bit fields in the PORTx register.
//
//*****************************************************************************

#define Rxn                           0x00007F80      // Port I/O Value


//*****************************************************************************
//
// The following are defines for the bit fields in the LATx register.
//
//*****************************************************************************

#define LATxn                         0x00007F80      // Output Latch Value


//*****************************************************************************
//
// The following are defines for the bit fields in the TRISx register.
//
//*****************************************************************************

#define TRISxn                        0x00007F80      // Port I/O Tri-state Control


//*****************************************************************************
//
// The following are defines for the bit fields in the ANSELx register.
//
//*****************************************************************************

#define ANSELxn                       0x00007F80      // Analog Select on RX Pin


//*****************************************************************************
//
// The following are defines for the bit fields in the WPUx register.
//
//*****************************************************************************

#define WPUxn                         0x00007F80      // Weak Pull-up PORTx Control


//*****************************************************************************
//
// The following are defines for the bit fields in the INLVLx register.
//
//*****************************************************************************

#define INLVLxn                       0x00007F80      // Input Level Select on RX Pin


//*****************************************************************************
//
// The following are defines for the bit fields in the SLRCONx register.
//
//*****************************************************************************

#define SLRxn                         0x00007F80      // Slew Rate Control on RX Pin


//*****************************************************************************
//
// The following are defines for the bit fields in the ODCONx register.
//
//*****************************************************************************

#define ODCxn                         0x00007F80      // Open-Drain Configuration on Rx Pin


//*****************************************************************************
//
// The following are defines for the bit fields in the RxyI2C register.
//
//*****************************************************************************

#define SLEW                          0x00000040      // I2C Specific Slew Rate Limiting Control
#define PU[1:0]                       0x00000060      // I2C Pull-Up Selection
#define TH[1:0]                       0x00000006      // I2C Input Threshold Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the IOCxF register.
//
//*****************************************************************************

#define IOCxFn                        0x00007F80      // Interrupt-on-Change Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the IOCxN register.
//
//*****************************************************************************

#define IOCxNn                        0x00007F80      // Interrupt-on-Change Negative Edge Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the IOCxP register.
//
//*****************************************************************************

#define IOCxPn                        0x00007F80      // Interrupt-on-Change Positive Edge Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the xxxPPS register.
//
//*****************************************************************************

#define PORT[2:0]                     0x00000020      // Peripheral Input PORT Selection
#define PIN[2:0]                      0x00000004      // Peripheral Input PORT Pin Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the RxyPPS register.
//
//*****************************************************************************

#define RxyPPS[5:0]                   0x00000020      // Pin Rxy Output Source Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the PPSLOCK register.
//
//*****************************************************************************

#define PPSLOCKED                     0x00000001      // PPS Locked


//*****************************************************************************
//
// The following are defines for the bit fields in the CRCCON0 register.
//
//*****************************************************************************

#define EN                            0x00000080      // CRC Enable
#define GO                            0x00000040      // CRC Start
#define BUSY                          0x00000020      // CRC Busy
#define ACCM                          0x00000010      // Accumulator Mode
#define SETUP[1:0]                    0x00000018      // Register Overlay Setup
#define SHIFTM                        0x00000002      // Shift Mode
#define FULL                          0x00000001      // Data Path Full Indicator


//*****************************************************************************
//
// The following are defines for the bit fields in the CRCCON1 register.
//
//*****************************************************************************

#define PLEN[4:0]                     0x000001F0      // Polynomial Length


//*****************************************************************************
//
// The following are defines for the bit fields in the CRCCON2 register.
//
//*****************************************************************************

