MikroElektronika/core_packages/PIC/XC8/def/PIC16F18176/mcu.h
#define DLEN[4:0]                     0x000001F0      // Data Length


//*****************************************************************************
//
// The following are defines for the bit fields in the CRCDATA register.
//
//*****************************************************************************

#define CRCDATAT[7:0]                 0x7F80000000      // CRC Data Top Byte
#define CRCDATAU[7:0]                 0x7F800000      // CRC Data Upper Byte
#define CRCDATAH[7:0]                 0x007F8000      // CRC Data High Byte
#define CRCDATAL[7:0]                 0x00007F80      // CRC Data Low Byte


//*****************************************************************************
//
// The following are defines for the bit fields in the CRCOUT register.
//
//*****************************************************************************

#define CRCOUTT[7:0]                  0x7F80000000      // CRC Output Register Top Byte
#define CRCOUTU[7:0]                  0x7F800000      // CRC Output Register Upper Byte
#define CRCOUTH[7:0]                  0x007F8000      // CRC Output Register High Byte
#define CRCOUTL[7:0]                  0x00007F80      // CRC Output Register Low Byte


//*****************************************************************************
//
// The following are defines for the bit fields in the CRCSHIFT register.
//
//*****************************************************************************

#define CRCSHIFTT[7:0]                0x7F80000000      // CRC Shift Register Top Byte
#define CRCSHIFTU[7:0]                0x7F800000      // CRC Shift Register Upper Byte
#define CRCSHIFTH[7:0]                0x007F8000      // CRC Shift Register High Byte
#define CRCSHIFTL[7:0]                0x00007F80      // CRC Shift Register Low Byte


//*****************************************************************************
//
// The following are defines for the bit fields in the CRCXOR register.
//
//*****************************************************************************

#define CRCXORT[7:0]                  0x7F80000000      // XOR of Polynomial Term XN Enable Top Byte
#define CRCXORU[7:0]                  0x7F800000      // XOR of Polynomial Term XN Enable Upper Byte
#define CRCXORH[7:0]                  0x007F8000      // XOR of Polynomial Term XN Enable High Byte
#define CRCXORL[7:0]                  0x00007F80      // XOR of Polynomial Term XN Enable Low Byte


//*****************************************************************************
//
// The following are defines for the bit fields in the SCANCON0 register.
//
//*****************************************************************************

#define EN                            0x00000080      // Scanner Enable
#define SGO                           0x00000040      // Scanner GO
#define BUSY                          0x00000020      // Scanner Busy Indicator
#define DABORT                        0x00000010      // Scanner Abort Signal
#define INTM                          0x00000008      // Scanner Interrupt Management Mode Select
#define MD[1:0]                       0x00000006      // Scanner Memory Access Mode Select


//*****************************************************************************
//
// The following are defines for the bit fields in the SCANLADR register.
//
//*****************************************************************************

#define SCANLADRH[7:0]                0x007F8000      // Scan Start/Current Address high byte
#define SCANLADRL[7:0]                0x00007F80      // Scan Start/Current Address low byte


//*****************************************************************************
//
// The following are defines for the bit fields in the SCANHADR register.
//
//*****************************************************************************

#define SCANHADRH[7:0]                0x007F8000      // Scan End Address
#define SCANHADRL[7:0]                0x00007F80      // Scan End Address


//*****************************************************************************
//
// The following are defines for the bit fields in the SCANTRIG register.
//
//*****************************************************************************

#define TSEL[3:0]                     0x00000078      // Scanner Data Trigger Input Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the PMD0 register.
//
//*****************************************************************************

#define TMR0MD                        0x00000080      // Disable TMR0
#define CLKRMD                        0x00000040      // Disable Clock Reference
#define IOCMD                         0x00000020      // Disable Interrupt-on-Change
#define ACTMD                         0x00000010      // Disable Active Clock Tuning
#define SYSCMD                        0x00000008      // Disable Peripheral System Clock Network(1)
#define SCANMD                        0x00000004      // Disable NVM Memory Scanner
#define CRCMD                         0x00000002      // Disable CRC Module
#define NVMMD                         0x00000001      // Disable NVM access


//*****************************************************************************
//
// The following are defines for the bit fields in the PMD1 register.
//
//*****************************************************************************

#define PWM1MD                        0x00000080      // Disable PWM1 Module
#define CCP2MD                        0x00000040      // Disable CCP2 Module
#define CCP1MD                        0x00000020      // Disable CCP1 Module
#define TMR4MD                        0x00000010      // Disable Timer TMR4
#define TMR2MD                        0x00000008      // Disable Timer TMR2
#define TMR3MD                        0x00000004      // Disable Timer TMR3
#define TMR1MD                        0x00000002      // Disable Timer TMR1


//*****************************************************************************
//
// The following are defines for the bit fields in the PMD2 register.
//
//*****************************************************************************

#define CLC3MD                        0x00000080      // Disable CLC3
#define CLC2MD                        0x00000040      // Disable CLC2
#define CLC1MD                        0x00000020      // Disable CLC1
#define CWG1MD                        0x00000010      // Disable CWG1
#define NCO1MD                        0x00000008      // Disable NCO1
#define PWM2MD                        0x00000001      // Disable PWM2


//*****************************************************************************
//
// The following are defines for the bit fields in the PMD3 register.
//
//*****************************************************************************

#define CM2MD                         0x00000080      // Disable Comparator 2
#define CM1MD                         0x00000040      // Disable Comparator 1
#define FVRMD                         0x00000020      // Disable Fixed Voltage Reference Module
#define MSSP2MD                       0x00000010      // Disable MSSP2 Module
#define MSSP1MD                       0x00000008      // Disable MSSP1 Module
#define UART2MD                       0x00000004      // Disable UART2 Module
#define UART1MD                       0x00000002      // Disable UART1 Module
#define CLC4MD                        0x00000001      // Disable CLC4


//*****************************************************************************
//
// The following are defines for the bit fields in the PMD4 register.
//
//*****************************************************************************

