MikroElektronika/core_packages/PIC/XC8/def/PIC16F18176/mcu.h
#define ZCDMD                         0x00000010      // Disable Zero Cross Detect(1)
#define DAC2MD                        0x00000004      // Disable Digital-to-Analog Converter 2
#define DAC1MD                        0x00000002      // Disable Digital-to-Analog Converter 1
#define ADCMD                         0x00000001      // Disable Analog-to-Digital Converter


//*****************************************************************************
//
// The following are defines for the bit fields in the CLKRCON register.
//
//*****************************************************************************

#define EN                            0x00000080      // Reference Clock Module Enable
#define DC[1:0]                       0x00000030      // Reference Clock Duty Cycle
#define DIV[2:0]                      0x0000001C      // Reference Clock Divider


//*****************************************************************************
//
// The following are defines for the bit fields in the CLKRCLK register.
//
//*****************************************************************************

#define CLK[3:0]                      0x00000078      // CLKR Clock Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the T0CON0 register.
//
//*****************************************************************************

#define EN                            0x00000080      // TMR0 Enable
#define OUT                           0x00000020      // TMR0 Output
#define MD16                          0x00000010      // 16-Bit Timer Operation Select
#define OUTPS[3:0]                    0x00000008      // TMR0 Output Postscaler (Divider) Select


//*****************************************************************************
//
// The following are defines for the bit fields in the T0CON1 register.
//
//*****************************************************************************

#define CS[2:0]                       0x00000080      // Timer0 Clock Source Select
#define ASYNC                         0x00000010      // TMR0 Input Asynchronization Enable
#define CKPS[3:0]                     0x00000008      // Prescaler Rate Select


//*****************************************************************************
//
// The following are defines for the bit fields in the TMR0H register.
//
//*****************************************************************************

#define TMR0H[7:0]                    0x00000080      // TMR0 Most Significant Counter


//*****************************************************************************
//
// The following are defines for the bit fields in the TMR0L register.
//
//*****************************************************************************

#define TMR0L[7:0]                    0x00000080      // TMR0 Least Significant Counter


//*****************************************************************************
//
// The following are defines for the bit fields in the TxCON register.
//
//*****************************************************************************

#define CKPS[1:0]                     0x00000060      // Timer Input Clock Prescaler Select
#define SYNC                          0x00000004      // Timer External Clock Input Synchronization Control
#define RD16                          0x00000002      // 16-Bit Read/Write Mode Enable
#define ON                            0x00000001      // Timer On


//*****************************************************************************
//
// The following are defines for the bit fields in the TxGCON register.
//
//*****************************************************************************

#define GE                            0x00000080      // Timer Gate Enable
#define GPOL                          0x00000040      // Timer Gate Polarity
#define GTM                           0x00000020      // Timer Gate Toggle Mode
#define GSPM                          0x00000010      // Timer Gate Single Pulse Mode
#define GGO/DONE                      0x00000008      // Timer Gate Single Pulse Acquisition Status
#define GVAL                          0x00000004      // Timer Gate Current State


//*****************************************************************************
//
// The following are defines for the bit fields in the TxCLK register.
//
//*****************************************************************************

#define CS[4:0]                       0x000001F0      // Timer Clock Source Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the TxGATE register.
//
//*****************************************************************************

#define GSS[4:0]                      0x000001F0      // Timer Gate Source Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the TMRx register.
//
//*****************************************************************************

#define TMRx[15:0]                    0x7FFF8000      // Timer Register Value


//*****************************************************************************
//
// The following are defines for the bit fields in the TxTMR register.
//
//*****************************************************************************

#define TxTMR[7:0]                    0x00000080      // Timerx Counter


//*****************************************************************************
//
// The following are defines for the bit fields in the TxPR register.
//
//*****************************************************************************

#define TxPR[7:0]                     0x00000080      // Timer Period Register


//*****************************************************************************
//
// The following are defines for the bit fields in the TxCON register.
//
//*****************************************************************************

#define ON                            0x00000080      // Timer On
#define CKPS[2:0]                     0x00000040      // Timer Clock Prescale Select
#define OUTPS[3:0]                    0x00000008      // Timer Output Postscaler Select


//*****************************************************************************
//
// The following are defines for the bit fields in the TxHLT register.
//
//*****************************************************************************

