MikroElektronika/core_packages/PIC/XC8/def/PIC16F18176/mcu.h
#define PSYNC                         0x00000080      // Timer Prescaler Synchronization Enable
#define CPOL                          0x00000040      // Timer Clock Polarity Selection
#define CSYNC                         0x00000020      // Timer Clock Synchronization Enable
#define MODE[4:0]                     0x00000010      // Timer Control Mode Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the TxCLKCON register.
//
//*****************************************************************************

#define CS[3:0]                       0x00000008      // Timer Clock Source Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the TxRST register.
//
//*****************************************************************************

#define RSEL[4:0]                     0x00000010      // External Reset Source Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the NCOxCON register.
//
//*****************************************************************************

#define EN                            0x00000080      // NCO Enable
#define OUT                           0x00000020      // NCO Output
#define POL                           0x00000010      // NCO Polarity
#define PFM                           0x00000001      // NCO Pulse Frequency Mode


//*****************************************************************************
//
// The following are defines for the bit fields in the NCOxCLK register.
//
//*****************************************************************************

#define PWS[2:0]                      0x00000380      // NCO Output Pulse-Width Select
#define CKS[3:0]                      0x00000078      // NCO Clock Source Select


//*****************************************************************************
//
// The following are defines for the bit fields in the NCOxACC register.
//
//*****************************************************************************

#define ACC[19:0]                     0x7FFFF80000      // Accumulated sum of NCO additions


//*****************************************************************************
//
// The following are defines for the bit fields in the NCOxINC register.
//
//*****************************************************************************

#define INC[19:0]                     0x7FFFF80000      // Value by which the NCOxACC is increased by each NCO clock


//*****************************************************************************
//
// The following are defines for the bit fields in the CWGxCON0 register.
//
//*****************************************************************************

#define EN                            0x00000080      // CWG Enable
#define LD                            0x00000040      // CWG1 Load Buffers
#define MODE[2:0]                     0x0000001C      // CWG Mode


//*****************************************************************************
//
// The following are defines for the bit fields in the CWGxCON1 register.
//
//*****************************************************************************

#define IN                            0x00000020      // CWG Input Value
#define POLy                          0x00000078      // CWG Output ‘y’ Polarity


//*****************************************************************************
//
// The following are defines for the bit fields in the CWGxCLK register.
//
//*****************************************************************************

#define CS                            0x00000001      // CWG Clock Source Selection Select


//*****************************************************************************
//
// The following are defines for the bit fields in the CWGxISM register.
//
//*****************************************************************************

#define ISM[4:0]                      0x000001F0      // CWG Data Input Source Select


//*****************************************************************************
//
// The following are defines for the bit fields in the CWGxSTR register.
//
//*****************************************************************************

#define OVRy                          0x00000780      // Steering Data OVR'y'
#define STRy                          0x00000078      // STR'y' Steering Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the CWGxAS0 register.
//
//*****************************************************************************

#define SHUTDOWN                      0x00000080      // Auto-Shutdown Event Status
#define REN                           0x00000040      // Auto-Restart Enable
#define LSBD[1:0]                     0x00000060      // CWGxB and CWGxD Auto-Shutdown State Control
#define LSAC[1:0]                     0x00000018      // CWGxA and CWGxC Auto-Shutdown State Control


//*****************************************************************************
//
// The following are defines for the bit fields in the CWGxAS1 register.
//
//*****************************************************************************

#define ASyE                          0x00007F80      // CWG Auto-Shutdown Source Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the CWGxDBR register.
//
//*****************************************************************************

#define DBR[5:0]                      0x000007E0      // CWG Rising Edge-Triggered Dead-Band Count


//*****************************************************************************
//
// The following are defines for the bit fields in the CWGxDBF register.
//
//*****************************************************************************

