MikroElektronika/core_packages/PIC/XC8/def/PIC16F18176/mcu.h
#define DBF[5:0]                      0x000007E0      // CWG Falling Edge-Triggered Dead-Band Count


//*****************************************************************************
//
// The following are defines for the bit fields in the CCPxCON register.
//
//*****************************************************************************

#define EN                            0x00000080      // CCP Module Enable
#define OUT                           0x00000020      // CCP Output Data (read-only)
#define FMT                           0x00000010      // CCPxRH:L Value Alignment (PWM mode)
#define MODE[3:0]                     0x00000078      // CCP Mode Select


//*****************************************************************************
//
// The following are defines for the bit fields in the CCPxCAP register.
//
//*****************************************************************************

#define CTS[3:0]                      0x00000078      // Capture Trigger Input Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the CCPTMRS0 register.
//
//*****************************************************************************

#define C1TSEL                        0x00000004      // CCP1 Timer Selection
#define C2TSEL                        0x00000001      // CCP2 Timer Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the 29.9.1. PWMxERS register.
//
//*****************************************************************************

#define ERS[3:0]                      0x00000008      // External Reset Source Select


//*****************************************************************************
//
// The following are defines for the bit fields in the 29.9.2. PWMxCLK register.
//
//*****************************************************************************

#define CLK[3:0]                      0x00000008      // PWM Clock Source Select


//*****************************************************************************
//
// The following are defines for the bit fields in the 29.9.3. PWMxLDS register.
//
//*****************************************************************************

#define LDS[2:0]                      0x00000004      // Auto-load Trigger Source Select


//*****************************************************************************
//
// The following are defines for the bit fields in the 29.9.4. PWMxPR register.
//
//*****************************************************************************

#define PR[15:0]                      0x00008000      // PWM Period


//*****************************************************************************
//
// The following are defines for the bit fields in the 29.9.5. PWMxCPRE register.
//
//*****************************************************************************

#define CPRE[7:0]                     0x00000080      // PWM Clock Prescale Value


//*****************************************************************************
//
// The following are defines for the bit fields in the 29.9.6. PWMxPIPOS register.
//
//*****************************************************************************

#define PIPOS[7:0]                    0x00000080      // Period Interrupt Postscale Value


//*****************************************************************************
//
// The following are defines for the bit fields in the 29.9.7. PWMxGIR register.
//
//*****************************************************************************

#define S1P2                          0x00000002      // Slice “a” Parameter 2 Interrupt Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the 29.9.8. PWMxGIE register.
//
//*****************************************************************************

#define S1P2                          0x00000002      // Slice “a” Parameter 2 Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the 29.9.9. PWMxCON register.
//
//*****************************************************************************

#define EN                            0x00000080      // PWM Module Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the 29.9.10. PWMxSaCFG register.
//
//*****************************************************************************

#define POL2                          0x00000080      // PWM Slice “a” Parameter 2 Output Polarity


//*****************************************************************************
//
// The following are defines for the bit fields in the 29.9.11. PWMxSaP1 register.
//
//*****************************************************************************

#define P1[15:0]                      0x00008000      // Parameter 1 Value


//*****************************************************************************
//
// The following are defines for the bit fields in the 29.9.12. PWMxSaP2 register.
//
//*****************************************************************************

#define P2[15:0]                      0x00008000      // Parameter 2 Value


//*****************************************************************************
//
// The following are defines for the bit fields in the 29.9.13. PWMLOAD register.
//
//*****************************************************************************

#define MPWM2LD                       0x00000002      // Mirror copy of PWMxLD bit


//*****************************************************************************
//
// The following are defines for the bit fields in the 29.9.14. PWMEN register.
//
//*****************************************************************************

#define MPWM2EN                       0x00000002      // Mirror copy of PWMxEN bit


//*****************************************************************************
//
// The following are defines for the bit fields in the CLCSELECT register.
//
//*****************************************************************************

#define SLCT[3:0]                     0x00000008      // CLC instance selection


//*****************************************************************************
//
// The following are defines for the bit fields in the CLCnCON register.
//
//*****************************************************************************

#define EN                            0x00000080      // CLC Enable
#define OUT                           0x00000020      // Logic cell output data, after LCPOL. Sampled from CLCxOUT.
#define INTP                          0x00000010      // Configurable Logic Cell Positive Edge Going Interrupt Enable
#define INTN                          0x00000008      // Configurable Logic Cell Negative Edge Going Interrupt Enable
#define MODE[2:0]                     0x00000004      // Configurable Logic Cell Functional Mode Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the CLCnPOL register.
//
//*****************************************************************************

#define POL                           0x00000080      // CLCxOUT Output Polarity Control
#define G4POL, G3POL, G2POL, G1POL    0x00000001      // Gate Output Polarity Control


//*****************************************************************************
//
// The following are defines for the bit fields in the CLCnSEL0 register.
//
//*****************************************************************************

#define D1S[6:0]                      0x00000040      // CLCn Data1 Input Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the CLCnSEL1 register.
//
//*****************************************************************************

#define D2S[6:0]                      0x00000040      // CLCn Data2 Input Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the CLCnSEL2 register.
//
//*****************************************************************************

#define D3S[6:0]                      0x00000040      // CLCn Data3 Input Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the CLCnSEL3 register.
//
//*****************************************************************************

#define D4S[6:0]                      0x00000040      // CLCn Data4 Input Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the CLCnGLS0 register.
//
//*****************************************************************************

#define G1DyT                         0x00000002      // dyT: Gate1 Data ‘y’ True (noninverted)
#define G1DyN                         0x00000001      // dyN: Gate1 Data ‘y’ Negated (inverted)


//*****************************************************************************
//
// The following are defines for the bit fields in the CLCnGLS1 register.
//
//*****************************************************************************

#define G2DyT                         0x00000002      // dyT: Gate2 Data ‘y’ True (noninverted)
#define G2DyN                         0x00000001      // dyN: Gate2 Data ‘y’ Negated (inverted)


//*****************************************************************************
//
// The following are defines for the bit fields in the CLCnGLS2 register.
//
//*****************************************************************************

#define G3DyT                         0x00000002      // dyT: Gate3 Data ‘y’ True (noninverted)
#define G3DyN                         0x00000001      // dyN: Gate3 Data ‘y’ Negated (inverted)


//*****************************************************************************
//
// The following are defines for the bit fields in the CLCnGLS3 register.
//
//*****************************************************************************

