MikroElektronika/core_packages/PIC/XC8/def/PIC16F18176/mcu.h
#define G4DyT                         0x00000002      // dyT: Gate4 Data ‘y’ True (noninverted)
#define G4DyN                         0x00000001      // dyN: Gate4 Data ‘y’ Negated (inverted)


//*****************************************************************************
//
// The following are defines for the bit fields in the CLCDATA register.
//
//*****************************************************************************

#define CLCxOUT                       0x00000001      // Mirror copy of CLCx_out


//*****************************************************************************
//
// The following are defines for the bit fields in the TXxSTA register.
//
//*****************************************************************************

#define CSRC                          0x00000080      // Clock Source Select
#define TX9                           0x00000040      // 9-Bit Transmit Enable
#define TXEN                          0x00000020      // Transmit Enable
#define SYNC                          0x00000010      // EUSART Mode Select
#define SENDB                         0x00000008      // Send Break Character
#define BRGH                          0x00000004      // High Baud Rate Select
#define TRMT                          0x00000002      // Transmit Shift Register (TSR) Status
#define TX9D                          0x00000001      // Ninth Bit of Transmit Data


//*****************************************************************************
//
// The following are defines for the bit fields in the RCxSTA register.
//
//*****************************************************************************

#define SPEN                          0x00000080      // Serial Port Enable
#define RX9                           0x00000040      // 9-Bit Receive Enable
#define SREN                          0x00000020      // Single Receive Enable
#define CREN                          0x00000010      // Continuous Receive Enable
#define ADDEN                         0x00000008      // Address Detect Enable
#define FERR                          0x00000004      // Framing Error
#define OERR                          0x00000002      // Overrun Error
#define RX9D                          0x00000001      // Ninth bit of Received Data


//*****************************************************************************
//
// The following are defines for the bit fields in the BAUDxCON register.
//
//*****************************************************************************

#define ABDOVF                        0x00000080      // Auto-Baud Detect Overflow
#define RCIDL                         0x00000040      // Receive Idle Flag
#define SCKP                          0x00000010      // Clock/Transmit Polarity Select
#define BRG16                         0x00000008      // 16-bit Baud Rate Generator Select
#define WUE                           0x00000002      // Wake-Up Enable
#define ABDEN                         0x00000001      // Auto-Baud Detect Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the RCxREG register.
//
//*****************************************************************************

#define RCREG[7:0]                    0x00007F80      // Receive data


//*****************************************************************************
//
// The following are defines for the bit fields in the TXxREG register.
//
//*****************************************************************************

#define TXREG[7:0]                    0x00007F80      // Transmit Data


//*****************************************************************************
//
// The following are defines for the bit fields in the SPxBRG register.
//
//*****************************************************************************

#define SPBRG[15:0]                   0x7FFF8000      // Baud Rate Register ::


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCON0 register.
//
//*****************************************************************************

#define ON                            0x00000080      // ADC Enable
#define CONT                          0x00000040      // ADC Continuous Operation Enable
#define CS                            0x00000010      // ADC Clock Selection
#define FM[1:0]                       0x00000018      // ADC Results Format/Alignment Selection
#define IC                            0x00000002      // ADC Input Configuration
#define GO                            0x00000001      // ADC Conversion Status


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCON1 register.
//
//*****************************************************************************

#define PPOL                          0x00000080      // Precharge Polarity
#define IPEN                          0x00000040      // A/D Inverted Precharge Enable
#define GPOL                          0x00000020      // Guard Ring Polarity Selection
#define PCSC                          0x00000002      // Precharge Sample Capacitor Only
#define DSEN                          0x00000001      // Double-Sample Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCON2 register.
//
//*****************************************************************************

#define PSIS                          0x00000080      // ADC Previous Sample Input Select
#define CRS[2:0]                      0x000001C0      // ADC Accumulated Calculation Right Shift Select
#define ACLR                          0x00000008      // A/D Accumulator Clear Command
#define MD[2:0]                       0x0000001C      // ADC Operating Mode Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCON3 register.
//
//*****************************************************************************

#define CALC[2:0]                     0x000001C0      // ADC Error Calculation Mode Select
#define SOI                           0x00000008      // ADC Stop-on-Interrupt
#define TMD[2:0]                      0x0000001C      // Threshold Interrupt Mode Select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADSTAT register.
//
//*****************************************************************************

