MikroElektronika/core_packages/PIC/XC8/def/PIC16F18176/mcu.h
#define AOV                           0x00000080      // ADC Accumulator Overflow
#define UTHR                          0x00000040      // ADC Module Greater-than Upper Threshold Flag
#define LTHR                          0x00000020      // ADC Module Less-than Lower Threshold Flag
#define MATH                          0x00000010      // ADC Module Computation Status
#define STAT[2:0]                     0x0000001C      // ADC Module Cycle Multi-Stage Status


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCLK register.
//
//*****************************************************************************

#define CS[5:0]                       0x000007E0      // ADC Clock divider Select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADREF register.
//
//*****************************************************************************

#define PREF[1:0]                     0x00000006      // ADC Positive Voltage Reference Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the ADPCH register.
//
//*****************************************************************************

#define PCH[5:0]                      0x000007E0      // ADC Positive Input Channel Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the ADNCH register.
//
//*****************************************************************************

#define NCH[5:0]                      0x000007E0      // ADC Negative Input Channel Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the ADPRE register.
//
//*****************************************************************************

#define PRE[12:0]                     0x01FFF000      // Precharge Time Select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADACQ register.
//
//*****************************************************************************

#define ACQ[12:0]                     0x01FFF000      // Acquisition (charge share time) Select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCAP register.
//
//*****************************************************************************

#define CAP[4:0]                      0x000001F0      // ADC Additional Sample Capacitor Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the ADRPT register.
//
//*****************************************************************************

#define RPT[7:0]                      0x00007F80      // ADC Repeat Threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCNT register.
//
//*****************************************************************************

#define CNT[7:0]                      0x00007F80      // ADC Repeat Count


//*****************************************************************************
//
// The following are defines for the bit fields in the ADFLTR register.
//
//*****************************************************************************

#define FLTR[15:0]                    0x7FFF8000      // ADC Filter Output - Signed two’s complement


//*****************************************************************************
//
// The following are defines for the bit fields in the ADRES register.
//
//*****************************************************************************

#define RES[15:0]                     0x7FFF8000      // ADC Sample Result ::
#define RES                           0x00008000      // ADC Sample Result


//*****************************************************************************
//
// The following are defines for the bit fields in the ADPREV register.
//
//*****************************************************************************

#define PREV[15:0]                    0x7FFF8000      // Previous ADC Result
#define PREV                          0x00008000      // Previous ADC Result


//*****************************************************************************
//
// The following are defines for the bit fields in the ADACC register.
//
//*****************************************************************************

#define ACC[17:0]                     0x7FFFE0000      // ADC Accumulator - Signed two’s complement ::
#define ACC                           0x00020000      // ADC Accumulator - Signed two’s complement


//*****************************************************************************
//
// The following are defines for the bit fields in the ADSTPT register.
//
//*****************************************************************************

#define STPT[15:0]                    0x7FFF8000      // ADC Threshold Setpoint - Signed two’s complement ::
#define STPT                          0x00008000      // ADC Threshold Setpoint - Signed two’s complement


//*****************************************************************************
//
// The following are defines for the bit fields in the ADERR register.
//
//*****************************************************************************

#define ERR[15:0]                     0x7FFF8000      // ADC Setpoint Error - Signed two’s complement ::
#define ERR                           0x00008000      // ADC Setpoint Error - Signed two’s complement


//*****************************************************************************
//
// The following are defines for the bit fields in the ADLTH register.
//
//*****************************************************************************

#define LTH[15:0]                     0x7FFF8000      // ADC Lower Threshold - Signed two’s complement ::
#define LTH                           0x00008000      // ADC Lower Threshold - Signed two’s complement


//*****************************************************************************
//
// The following are defines for the bit fields in the ADUTH register.
//
//*****************************************************************************

#define UTH[15:0]                     0x7FFF8000      // ADC Upper Threshold - Signed two’s complement ::
#define UTH                           0x00008000      // ADC Upper Threshold - Signed two’s complement


//*****************************************************************************
//
// The following are defines for the bit fields in the ADACT register.
//
//*****************************************************************************

