MikroElektronika/core_packages/PIC/XC8/def/PIC16F18176/mcu.h
#define ACT[4:0]                      0x000001F0      // Auto-Conversion Trigger Select
#define ACT                           0x00000010      // Auto-Conversion Trigger Select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCGxA register.
//
//*****************************************************************************

#define CGA4, CGA5                    0x00000010      // Channel Group Selection Enable on RA Pins
#define CGA0, CGA1, CGA2              0x00000001      // Channel Group Selection Enable on RA Pins


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCGxB register.
//
//*****************************************************************************

#define CGB4, CGB5, CGB6, CGB7        0x00000010      // Channel Group Selection Enable on RB Pins


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCGxC register.
//
//*****************************************************************************

#define CGC3, CGC4, CGC5, CGC6, CGC7  0x00000008      // Channel Group Selection Enable on RC Pins
#define CGC0, CGC1, CGC2              0x00000001      // Channel Group Selection Enable on RC Pins ::


//*****************************************************************************
//
// The following are defines for the bit fields in the DACxCON register.
//
//*****************************************************************************

#define EN                            0x00000080      // DAC Enable
#define REFRNG                        0x00000040      // Buffer Reference Range Selection
#define OE                            0x00000060      // DAC Output Enable
#define PSS                           0x00000018      // DAC Positive Reference Selection
#define NSS                           0x00000001      // DAC Negative Reference Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the DACxDATL register.
//
//*****************************************************************************

#define DACxR                         0x00007F80      // Data Input Bits for DAC Value
#define DACxR                         0x00007F80      // Data Input Bits for DAC Value ::


//*****************************************************************************
//
// The following are defines for the bit fields in the CMxCON0 register.
//
//*****************************************************************************

#define EN                            0x00000080      // Comparator Enable
#define OUT                           0x00000040      // Comparator Output
#define POL                           0x00000010      // Comparator Output Polarity Select
#define HYS                           0x00000002      // Comparator Hysteresis Enable
#define SYNC                          0x00000001      // Comparator Output Synchronous Mode


//*****************************************************************************
//
// The following are defines for the bit fields in the CMxCON1 register.
//
//*****************************************************************************

#define INTP                          0x00000002      // Comparator Interrupt on Positive-Going Edge Enable
#define INTN                          0x00000001      // Comparator Interrupt on Negative-Going Edge Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the CMxNCH register.
//
//*****************************************************************************

#define NCH[2:0]                      0x0000001C      // Comparator Inverting Input Channel Select


//*****************************************************************************
//
// The following are defines for the bit fields in the CMxPCH register.
//
//*****************************************************************************

#define PCH[2:0]                      0x0000001C      // Comparator Noninverting Input Channel Select


//*****************************************************************************
//
// The following are defines for the bit fields in the CMOUT register.
//
//*****************************************************************************

#define CxOUT                         0x00000006      // Mirror copy of the CMxCON0.OUT


//*****************************************************************************
//
// The following are defines for the bit fields in the FVRCON register.
//
//*****************************************************************************

#define EN                            0x00000080      // Fixed Voltage Reference Enable
#define RDY                           0x00000040      // Fixed Voltage Reference Ready Flag
#define TSEN                          0x00000020      // Temperature Indicator Enable
#define TSRNG                         0x00000010      // Temperature Indicator Range Selection
#define CDAFVR[1:0]                   0x00000018      // FVR Buffer 2 Gain Selection
#define ADFVR[1:0]                    0x00000006      // FVR Buffer 1 Gain Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the FVRCON register.
//
//*****************************************************************************

#define EN                            0x00000080      // Fixed Voltage Reference Enable
#define RDY                           0x00000040      // Fixed Voltage Reference Ready Flag
#define TSEN                          0x00000020      // Temperature Indicator Enable
#define TSRNG                         0x00000010      // Temperature Indicator Range Selection
#define CDAFVR[1:0]                   0x00000018      // FVR Buffer 2 Gain Selection
#define ADFVR[1:0]                    0x00000006      // FVR Buffer 1 Gain Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the ZCDCON register.
//
//*****************************************************************************

#define SEN                           0x00000080      // Zero-Cross Detect Software Enable
#define OUT                           0x00000020      // Zero-Cross Detect Data Output
#define POL                           0x00000010      // Zero-Cross Detect Polarity
#define INTP                          0x00000002      // Zero-Cross Detect Positive-Going Edge Interrupt Enable
#define INTN                          0x00000001      // Zero-Cross Detect Negative-Going Edge Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the CPCON register.
//
//*****************************************************************************

#define CPON[1:0]                     0x00000180      // Charge Pump Enable
#define CPOS                          0x00000020      // Charge Pump Oscillator Selection
#define CPREQ                         0x00000004      // Charge Pump Request Status
#define CPT                           0x00000002      // Charge Pump Threshold
#define CPRDY                         0x00000001      // Charge Pump Ready Status



#endif // __PIC16F18176_H__

